<template>
    <div id="hongyanwangxiao">
        <div class="content">
            <select v-model="show" class="choose" >
                <option>科技联合会</option>
                <option>青年志愿者协会</option>
                <option>团委办公室</option>
                <option>团委宣传部</option>
                <option>团委组织部</option>
                <option>学生社团联合会</option>
                <option>大学生艺术团</option>
                <option>学生会</option>
            </select>
            <div class="infos" v-if="!(mode == 'list')">
                <ul>
                    <li v-if="show == '科技联合会'">
                        <div class="title">科技联合部</div>
                        <div class="info">
                        <h2>综合部</h2>
                        <p>综合部是学生科联的枢纽中心。它是连接团委、主席团和科联各个部门、干事之间的纽带，起到上传下达的作用，并以办公室的日常管理为工作重点。其主要负责制定、完善、推广科联制度；负责科联对外联络和洽谈；负责科联各部门内部协调；负责组织科联干部干事成立大会、素质拓展、科联交享悦、科联杯、干部干事培训和考核、人才互荐交流、总结晚会等活动；负责与各学院的学生科创组织保持紧密联系，开展交流活动；负责与兄弟高校的学生科创组织进行交流合作。</p>
                        <h2>科创竞赛部</h2>
                        <p>科创竞赛部是学生科技联合会的竞技中心。以“科创点亮未来，竞赛成就梦想”为理念，主要负责开展和推广校内外科技竞赛活动，如“科普先锋秀”、“无线电猎狐大赛”等；组织“挑战杯”（大挑）大学生课外学术科技作品竞赛、“创青春”（小挑）全国大学生创业大赛的申报和立项工作。致力于为全校提供一个校内外公平竞技的平台，营造良好的校园竞技氛围。<p>
                        <h2>项目管理部</h2>
                        <p>项目管理部是学生科联的科创中心，主要负责学生科联的创新、创业工作。负责协调开展“学生科技节”等系列大型科技活动，包括组织开展“学生课外学术科技作品竞赛”、“创新创业训练营”、“学生创新创业成果展”等系列活动。同时致力于“创新高端论坛”校内外创新创业沙龙活动、运用网络媒体发布校内外科创赛事资讯等，构建学校创新创业项目交流以及推广的平台，营造浓厚的科技创新创业氛围。<p>
                        <h2>科技人文部</h2>
                        <p>科技人文部作为学生科技联合会的文化活动中心，秉承着“科技点缀生活，人文融入梦想”的理念，以“文峰青年大讲堂”、“重邮青年说”、“学长演播厅”为主打品牌活动。文峰青年大讲堂诚邀知名专家学者和文化名人，旨在浓厚校园科技文化氛围的同时，强化人文环境，打造属于重邮的专属讲堂。重邮青年说旨在寻找和培养一批敢于发声，说出自己对生活的感悟的重邮人，传播年轻正能量。学长演播厅邀请优秀学长学姐，为新生答疑解惑，力求将最新最热最有用的大学资讯和成功经验分享给重邮学子。<p>
                        <h2>信息部</h2>
                        <p>信息部是学生科联的技术中心。其主要负责科技创新实践活动的培训与开展。Web组主要负责Html5的开发及Web前端的基础培训，静态网页与动态网页的制作；UI组负责对网页整体界面美观、人机交互、操作逻辑的设计；运营组主要负责利用PowerPoint和Premiere等软件来进行产品运营以及宣传。致力于“培养精英团队”，打造科联信息化平台，丰富科联的创新创意活动。<p>
                        <h2>媒体运营部</h2>
                        <p>媒体运营部是学生科联的创意中心。其主要负责学生科联创意设计及校内外宣传工作。设计海报、条漫及展板，活动现场布置等；制作活动视频、微电影和动画以及活动现场摄影摄像及新闻稿的撰写。同时也负责学生科联线上的运营工作，管理科联公众号的推广，通过海报、视频、网络等形式在校内外宣传科联活动，打响科联品牌，展示科联成果。<p>
                        <p>重庆邮电大学学生科技联合会</p>
                        <p>2018.07.03</p>
                        </div>
                    </li>
                    <li v-if="show == '青年志愿者协会'">
                        <div class="title">青年志愿者协会</div>
                        <div class="info">
                        <p>青年志愿者协会是校团委直属管辖的七大校级学生组织之一，接受校团委的管理和指导，青年志愿者协会秉承“奉献”，“友爱”，“进步”，“互助”的宗旨，参与志愿服务活动以及对志愿活动进行宣传，其下组织了“12·5”志愿周活动，“三月雷锋月活动”。青年志愿者协会现设主席一名，副主席三名，其下设有综合管理部，服务总队，实践服务部，宣传推广部，每个部门通过分工合作将青年志愿者协会运行的有理有序。</p>
                        <h2>综合管理部</h2>
                        <p>综合管理部负责青年志愿者协会内部事务的协调与管理，对学院的志愿活动的对接与考核，对青年志愿者协会内部物资进行管理，对学院志愿活动资料的收集整理及评分，以及负责志愿活动时长的管理和添加。</p>
                        <h2>服务总队</h2>
                        <p>青年志愿者服务总队的职能包括：“天天系列活动”，组织校内志愿服务活动，负责优秀志愿服务项目的评选，服务队考核。“天天”系列活动包括天天护跑、天天咨询、天天节电等。除“天天”系列活动外，总队的活动还有“邮我护花”，在三四月樱花盛开的校园里，志愿者将成为校园秩序的维护者，引导游客们规范、文明的赏花、踏青。服务总队在自身进步的同时，也推动青协的整体发展。</p>
                        <h2>实践服务部</h2>
                        <p>实践服务部是青年志愿者协会中主要负责校外志愿活动开展，校内对接院青协相关工作的部门。实践服务部主要前往社区面向小朋友们开展四点半课堂及周末课堂活动，通过为小朋友辅导作业的四点半课堂、富含特色活动主题的周末课堂，拓宽小朋友的知识面。此外，负责与院青协进行联系，参与学院志愿活动的考核工作，还负责校外活动志愿者招募的相关事项。</p>
                        <h2>宣传推广部</h2>
                        <p>宣传推广部负责官方QQ的日常运营以及微信推送，各项青年志愿服务活动宣传，校内外志愿活动的跟踪纪录；负责对志愿服务品牌项目进行推广，通过拍摄活动照片、推送优质文案以及录制视频直播等形式，使更多的人了解青协的工作，了解志愿活动。</p>
                        </div>
                    </li>
                    <li v-if="show == '团委办公室'">
                        <div class="title">团委办公室</div>
                        <div class="info">
                        <p>重庆邮电大学团委办公室(以下简称办公室）是共青团重庆邮电大学委员会直属机构之一。是学校团学工作的枢纽与核心，在团委与各校级学生组织之间起到桥梁与枢纽的作用，是所有学生组织中与老师联系最密切的部门，是团委老师的得力助手。办公室负责团委工作的上传下达——向上通过制作团委工作简报《重邮共青团》等，向团中央、团市委汇报学校团学工作动态；向下沟通联系各校级学生组织，传达团委相关工作要求，并针对学生组织相关工作予以监督。参与学生组织各类活动的筹备工作，负责学生活动场地的管理工作，监督并完善团建在线网站的建设。同时，办公室还协助完成学校大型活动的会务，秘书工作，协助完成大学生志愿者暑期“三下乡”社会实践活动，负责各项文件，奖状资料的管理存档工作。</p>
                        </div>
                    </li>
                    <li v-if="show == '团委宣传部'">
                        <div class="title">校团委宣传部</div>
                        <div class="info">
                        <p>校团委宣传部是我校团委的重要部门，担负着向学校、校团委各学生组织传达信息的重要任务，是校团委各部门正常工作的基本保证。宣传部是负责全校工作的宣传、报道，传达学校和团委的工作指示，会议通知，对广大团员青年进行思想政治教育、素质教育的宣传工作；负责通过网络、海报、橱窗、等形式开展政治思想教育工作。宣传部以丰富校园文化生活，活跃同学们的第二课堂，丰富广大同学的课余生活为己任，带领各团总支宣传部开展工作。</p>
                        </div>
                    </li>
                    <li v-if="show == '团委组织部'">
                        <div class="title">团委组织部</div>
                        <div class="info">
                        <p>重庆邮电大学团委组织部是校团委核心直属部室。组织部以“严谨 高效 励志 笃行”作为部训，协调统筹各学院团总支及基层团支部开展工作。是负责全校共青团的基层组织建设工作、推优入党工作、五四评优表彰工作、开展青年马克思主义培养工程、指导主题团日活动的开展和团支部“活力提升”工程的实施以及开展班级团支部和班委会一体化运行机制改革等工作的职能部门。</p>
                        </div>
                    </li>
                    <li v-if="show == '学生社团联合会'">
                        <div class="title">学生社团联合会</div>
                        <div class="info">
                        <p>社团联合会在校团委的直接指导下，管理社团工作、服务社团发展的学生组织，旗下管辖着涵盖文学学术、实践服务、艺术文化、爱好兴趣、体育运动等功能丰富、类型兼备的各类学生社团组织。目前，能否建设好高校的社团已经成为一个高校是否具有活力和文化氛围的重要标志之一。学生社团遍布全国高校校园的各个角落，扮演着丰富校园文化生活、提升校园文化品位、引领校园文化时尚的重要角色。</p>
                        <h2>主席团</h2>
                        <p>全面主持学生社联各项工作；制定社联工作计划和发展规划；指导、检查、督促各社团开展工作，协调与各学生组织 和社团之间的关系。</p>
                        <h2>综合部</h2>
                        <p>社联小当家。负责社联内部文书、考勤、活动筹备等工作，策划组织各项内部活动；负责学生社团精品活动物资的审批发放、场地申请；同时负责与兄弟高校社联组织、校内各组织及校外商家的联络。</p>
                        <h2>宣传部</h2>
                        <p>活动先行者。负责社联新媒体运营工作，搭建学生社团宣传平台。负责设计社联活动海报、视频等文化产品，同时审批社团活动海报等宣传制品。</p>
                        <h2>社团服务部</h2>
                        <p>社团小管家。负责管理社团与社团部。收集社团资料，督促社团发展，牵头社团招新，组织“百团大战”，十佳会长与优秀社团的答辩及社团换届，同时还负责社团活动物资的审批与发放。</p>
                        <h2>社团活动部</h2>
                        <p>活动执行官。负责审核、指导学生社团开展精品活动，牵头社联各部门举办社团达人秀、社团推广暨展示季等大型活动，增添校园文化色彩。</p>
                        </div>
                    </li>
                    <li v-if="show == '大学生艺术团'">
                        <div class="title">重邮大学生艺术团</div>
                        <div class="info">
                        <p>重庆邮电大学大学生艺术团是在校团委直接指导管理下的学生艺术团体，肩负组织学校重大文艺活动，代表学校对外联谊，演出和参加省市文艺大赛的重任。秉承“服务同学，锻炼自我”的宗旨，以丰富校园文化生活，陶冶情操，加强与其他院校艺术交流与沟通，为校宣传争光，活跃人文气氛等为前提，要求每个成员在艺术实践中以高标准、严要求的态度约束自己。 大学生艺术团由综合部、管乐团、民乐团、舞蹈团、合唱团、话剧团组成。主要承担着我校各项大型演出任务，组织编排各项文艺节目，为有文艺特长的同学搭建良好的交流和展示平台，每个分团都有固定的训练时间和专业指导老师。近年来，大学生艺术团一次次圆满完成学校交给的各项文艺演出任务，并锻炼和培养了一批批艺术人才。为我校大学生文艺素质的培养，树立了一面旗帜。</p>
                        <h2>综合部</h2>
                        <p>大学生艺术团综合部是整个大学生艺术团的心脏和大脑，负责整个艺术团后勤以及技术设备支持。目前，综合部内部分为日常工作组，负责校内各大文艺晚会和颁奖典礼的后勤工作，提供相关舞美、音响灯光调控和后台支持，同时通过外交衔接并管理着各大团以及团内的日常事务。宣传组，管理大学生艺术团官方公众号的运营，负责与艺术团相关活动的照片记录，新闻稿整理。校礼仪队，大学生艺术团综合部管理的礼仪队是重庆邮电大学唯一一支校级礼仪队，负责校内各大颁奖典礼的礼仪工作。</p>
                        <h2>管乐团</h2>
                        <p>重邮管乐团是重邮历史最悠久的校级团体之一，在大大小小的比赛舞台上获奖无数。乐团主要以木管，铜管，打击乐等多种类型乐器相配合，共同创作出精彩的演出。同时管乐团还有弦乐声部，作为高音和低音声部的补充，有小提琴，中提琴，大提琴，低音提琴，弦乐声部也多次以独立节目的形式参加校级文艺晚会进行演奏。</p>
                        <h2>民乐团</h2>
                        <p>大学生艺术团民乐团是以民族乐器为主，为学校各项活动演出与代表重邮参加艺术类比赛的校级组织。民乐团本着继承中国传统文化，发扬中国传统民族乐器的建团宗旨，培养学生音乐爱好与素养，丰富同学课余生活与文化活动。</p>
                        <h2>舞蹈团</h2>
                        <p>大学生艺术团舞蹈团是以民族舞、古典舞、现代舞为主的为各大舞台筹划演出和准备比赛的校级组织。老师会对所有成员根据自己擅长的舞种分组，比如民族舞、爵士舞、拉丁舞、街舞等等，再依据实际情况组织训练，保证每个人各施所长。平时会组织基本功、舞感训练和舞蹈组合的排练。学校的大型演出都有舞蹈团的身影，热爱舞蹈和舞台的你不要错过哟！</p>
                        <h2>合唱团</h2>
                        <p>重庆邮电大学合唱团自1995年成立以来，旨在丰富在校大学生的文化艺术生活，传承和发扬校园文化，服务人才培养，普及美育教育，传承重邮精神。重庆邮电大学合唱团用他们的歌声响彻南山之巅。全团分为四个声部，男高音声部、男低音声部、女高音声部、女低音声部，到时候会根据个人音色、音域进行初步划分，在平时训练中会根据情况进行细微的调整。</p>
                        <h2>话剧团</h2>
                        <p>话剧团是重庆邮电大学大学生艺术团下的分支团体，主要进行话剧舞台表演与展示。用剧本，演员，表演，灯光，舞台效果等带给每一个人话剧的非凡魅力。</p>
                        </div>
                    </li>
                    <li v-if="show == '学生会'">
                        <div class="title">学生会</div>
                        <div class="info">
                        <p>重庆邮电大学学生会是由校党委、市学联领导，由校团委具体指导的群众性组织。本着“全心全意为同学服务”的宗旨，认真服务青年学生，不断加强青年学生思想政治教育，努力促进和谐校园文化建设，开展丰富多彩的活动。学生会加强了学校党政、职能部门，各学院与同学间的沟通与联系，反映同学们的合理诉求，代表和维护同学们的正当权益。学生会品牌活动有“四个一”素质提升活动（培养一类文艺爱好、养成一个运动习惯、坚持一项志愿服务、提升一类表达能力）、校园十大歌手、信科杯辩论赛、运动梦想秀“三走”系列主题活动（走下网络、走出宿舍、走向操场）等校园活动。</p>
                        <h2>综合部</h2>
                        <p>主要负责学生会内部日常管理，协调各学院学生会工作，负责与兄弟高校学生会及校外单位、企业、协会的联络以及牵头对各学院学生会的考核。</p>
                        <h2>学习部</h2>
                        <p>积极开展各类学风建设活动，了解和收集同学对教学的意见和建议，组织开展辩论赛、读写行等活动，建设“学业互帮”学习互助平台以及协助校学业辅导中心开展学业分析工作。</p>
                        <h2>宣传部</h2>
                        <p>充分利用新媒体开展学生会宣传工作，设计制作新媒体推送、海报等文化产品并开展校园文化创意活动。</p>
                        <h2>权益提案部</h2>
                        <p>主要负责处理提案工作委员会日常事务，学生代表提案的征集、立案、报送、督办等工作。搭建青年学生维权服务平台。</p>
                        <h2>生活服务部</h2>
                        <p>处理食品安全与伙食监督管理委员会日常事务并做好与后勤、宿舍管理部门的沟通联系。组织开展饮食文化节等健康生活、文明生活主题活动。</p>
                        <h2>文艺部</h2>
                        <p>为同学搭建才艺展示平台，培养同学文艺爱好，并且在校内开展草坪音乐会、校园十大歌手、“英悦重邮”校园英文歌手大赛等校内文艺活动。</p>
                        <h2>体育部</h2>
                        <p>组织开展“三走”群众性体育锻炼活动，定期策划并举行拔河比赛，篮球赛，协办马拉松等符合当代大学生的有意义的非竞技性户外运动活动。</p>
                        <h2>女生部</h2>
                        <p>主要工作为反映广大女生的合理利益诉求，组织开展女生节系列活动，“美丽成长日记”系列手工活动并配合“文峰女子学堂”开展各类活动。</p>
                        </div>
                    </li>
                </ul>
            </div>
        </div>
    </div>
</template>

<script>
export default {
  name: 'xiaojizuzhi',
  data() {
    return {
      mode: 'info',
      show: '科技联合会',
    }
  },
  methods: {

  },
}
</script>


<style lang="scss" scoped>
.content::-webkit-scrollbar { width: 17px;}
.content::-webkit-scrollbar-thumb {
    background:
        url(../../../assets/img/Scroll/scroll-thumb-top.png) no-repeat top,
        url(../../../assets/img/Scroll/scroll-thumb-bottom.png) no-repeat bottom,
        url(../../../assets/img/Scroll/scroll-thumb-content.png);
}
.content::-webkit-scrollbar-button:start {
    height: 16px;
    background-image: url(../../../assets/img/Scroll/arrowUp.png);
    background-repeat: no-repeat;
}
.content::-webkit-scrollbar-button:end {
    height: 16px;
    background-image: url(../../../assets/img/Scroll/arrowDown.png);
    background-repeat: no-repeat;
}
.content::-webkit-scrollbar-track {
    background-image: url(../../../assets/img/Scroll/rail.png);
}

#hongyanwangxiao {
    width: 890px;
    height: 600px;

    .content {
        width: 899px;
        height: 570px;

        border: 2px solid rgb(57, 125, 218);
        background-color: rgb(176, 207, 255);
        overflow-x: hidden;
        overflow-y: scroll;
    }
}
.list {
    ul {
        list-style: none;
        font-size: 18px;
        li {
            font-family: '微软雅黑';
            color: rgb(2, 49, 169);
            margin-top: 40px;
            margin-left: 300px;
            cursor: pointer;
        }
    }
}
.infos {
    ul {
        list-style: none;
        li {
            color: rgb(2, 49, 169);
            margin-top: 40px;
            margin-left: 320px;
            .title {
                width: 200px;
                height: 50px;
                background-color: rgb(77, 117, 231);
                display: flex;
                justify-content: center;
                align-items: center;
                color: white;
                font-size: 22px;
                background: linear-gradient(-135deg, transparent 6px, #4d75e8 0);
            }
            .info {
                font-family: '微软雅黑';
                position: relative;
                right:300px;
                width: 850px;
                color: rgb(70, 106, 206);
                font-size: 16px;
                line-height: 30px;
                p {
                    color: rgb(2, 49, 169);
                    font-family: '微软雅黑';
                    font-size: 16px;
                    margin-top: 50px;
                    line-height: 30px;
                }
                h2 {
                    color: rgb(2, 49, 169);
                    font-family: '微软雅黑';
                    margin-top: 70px;
                    font-size: 18px;
                }
            }
        }
    }
}
.choose {
    position: relative;
    left: 700px;
    width: 150px;
    top:60px;
    background-color: rgb(183, 232, 255);
    border: 1.5px solid rgb(19, 131, 234);
    color: rgb(19, 131, 234)
}
</style>
